{
    "name":"vanila_projects",
    "desc":"it is the  folder that contains all the vanila projects",
    "folders":[
        {"name":"autowrite_text","desc":"A fixed sentence is splitted and dispalyed letter by letter until the last letter"},
        {"name":"background_changer","desc":"Chage background color with random colors with a button"},
        {"name":"bg_color_changing_with_curser","desc":"Change background color with mouse curser movement"},
        {"name":"darkmode_toggle","desc":"toggle page content color to dark or bright"},
        {"name":"form_validation","desc":"A basic example of client side validation of a form"},
        {"name":"heart_rain","desc":"A visualization of css animation using heart imojis"},
        {"name":"heartbeat_animation","desc":"visualization of a beating heart using css animation"},
        {"name":"loan_calculator","desc":"Loan calculator calculates the total amount to pay if someone loans some amount for a period of time"},
        {"name":"popup_window","desc":"A button that pops a window open and can be closed using exit button"},
        {"name":"random_letter_rain","desc":"A program that generates random alphabets and makes it look like raining with css animation"},
        {"name":"simple_auto_carousel","desc":"A image slider that automatically slides some fixed images in a frame"},
        {"name":"zoom_effect","desc":"Hover your mouse curser to  scale up a perticular section of a fixed image "},
        {"name":"slide_menu_button","desc":"A slider menu  that can be toggled using a button"},
        {"name":"sound_bord","desc":"A set of buttons to switch between different sounds"},
        {"name":"toast_notification_random_words","desc":"A button to generate push notifications with random words."},
        {"name":"animated_gradients","desc":"moving gradient background using css animation. only css animation."},
        {"name":"task_list","desc":"simple todo list type app. very minimalistic. performs simple create & delete operation"},
        {"name":"3d_flip_button","desc":"flipping a button using css perspective and rotation in z axis"},
        {"name":"animated_loder","desc":"loader animation using css border rotation"},
        {"name":"video_background","desc":"full screen responsive video background page with content"},
        {"name":"Exchange_rate_calculator","desc":""},
        {"name":"book_list_UI","desc":""},
        {"name":"liquid_animation","desc":""},
        {"name":"movie_seat_book","desc":""},
        {"name":"number_guesser","desc":""},
        {"name":"videoPlayer","desc":""},
        {"name":"","desc":""},
        {"name":"","desc":""},
        {"name":"","desc":""},
        {"name":"","desc":""}
    ]
}  